music_app/app/controllers/bands_controller.rb

    def destroy
        @band = Band.find(params[:id])
        if Band.destroy(@band.id)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]